package factory;
import logic.Customer;

import java.util.ArrayList;
import java.util.List;

public class Factory {
    public static List<Customer> createCustomers() {
        return new ArrayList<>(List.of(
                new Customer(1, "Борисова Марія Олександрівна", "Тернопіль","9862783251613232", 22865.59, 48, 6982.72),
                new Customer(2, "Шевченко Катерина Сергіївна", "Чернівці", "2525489376385555", 7825.94, 121, 2111.05 ),
                new Customer(3, "Рудий Максим Ігорович", "Миколаїв", "5269358915769726", 25.68, 86, 108.69 ),
                new Customer(4, "Малютін Дмитро Сергійович", "Херсон", "1235987678925366", -8211.12, 159, 28273.22),
                new Customer(5, "Вакуленко Володимир Юрійович", "Запоріжжя", "3598617538265971", 276.18, 65, 1583.31),
                new Customer(6, "Сєргєєва Таісія Генадіївна", "Миколаїв", "7966109394698969", 59110.00, 357, 50987.07),
                new Customer(7, "Малишко Валентина Юріївна", "Київ", "388084744986268", -6587.59, 861, 43278.51),
                new Customer(8, "Коцюбинський Вадим Дмитрович", "Херсон", "7973666611280004", 150.21, 0, 0.00),
                new Customer(9, "Сімперович Олександра Олександріна", "Київ", "8789263420158939", 0.00, 0, 0.00),
                new Customer(10, "Коваленко Артем Владиславович", "Миколаїв", "8885088972130327",9529.98,357 , 15977.65)
        ));
    }
}
